<a href="https://colab.research.google.com/github/0x31nose/python_tutorial_with_Colab/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

In [22]:
import pandas as pd
import numpy as np

## Series

In [ ]:
# dictionaryからSeriesを作る
data = {
    'Name': 'John',
    'Sex': 'male',
    'Age': 22
}

In [ ]:
pd.Series(data)

Name    John
Sex     male
Age       22
dtype: object

In [ ]:
# NumPy Arrayから作成
# NumPyArrayで作成する場合はインデックスが振られる。（0から3）
array = np.array([22, 31, 42, 23])
age_series = pd.Series(array)

In [ ]:
# インデックス番号だと扱いづらいのでラベルをつける
array = np.array(['John', 'male', 22])
# Seriesのラベルを指定して値を取り出す
john_series = pd.Series(array, index=['Name', 'Sex', 'Age'])
# 指定したラベルで取り出す
john_series['Name']

'John'

In [ ]:
# .valuesで値をNumpyとして扱うことが出来る
age_series.values

array([22, 31, 42, 23])

In [ ]:
# Numpyと同じように統計量を計算可能
age_series.mean()

29.5

### DataFrame

In [ ]:
# Numpy Array から作成
ndarray = np.arange(10).reshape(2, 5)
ndarray

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [ ]:
# index=[] で行のインデックスを指定可能
# columns=[] で列のインデックスを指定可能
#　文字列で指定しないと、０から始まるインデックスが自動的に割り振られる
pd.DataFrame(ndarray, index= ['index1', 'index2'], columns=['a', 'b', 'c', 'd', 'e'])

        a  b  c  d  e
index1  0  1  2  3  4
index2  5  6  7  8  9

In [ ]:
# DictionaryからDataFrameを作成する
data1 = {
    'name': 'John',
    'sex': 'male',
    'age': 22,
}
data2 = {
    'name': 'Hanako',
    'sex': 'female',
    'age': 29,
}
data3 = {
    'name': 'Alex',
    'sex': 'male',
    'age': 20,
}
data4 = {
    'name' : 'Corina',
    'sex' : 'female',
    'age' : 25,
}
# pd.DataFrame内にリスト形式で入れると、上記と同じように表形式に整理できる
# 行のインデックスを指定していないので、０から始まるインデックスで指定されていることがわかる
# この書き方だと、レコード数が多くなると書き方が大変

pd.DataFrame([data1, data2, data3, data4])

     name     sex  age
0    John    male   22
1  Hanako  female   29
2    Alex    male   20
3  Corina  female   25

In [ ]:
#　DictionaryのValueをインデックスとすることも出来て、作成が楽。
data = {
    'name': ['Jack', 'Eitan', 'Laura', 'Briana'],
    'sex': ['male', 'male', 'female', 'female'],
    'age': [34, 45, 25, 23],
}
# DataFrameのデータ量は大きくなりがち。何十万から何百万のデータになってしまう。
# 一つのコードの中で複数のDatFrameを入れることが難しくなる（メモリが溢れてしまう）
# そのため、dfという変数を使い回すことが多い。
df = pd.DataFrame(data)
df

     name     sex  age
0    Jack    male   34
1   Eitan    male   45
2   Laura  female   25
3  Briana  female   23

In [2]:
# csvからデータを読み込んでDataFrameに使っていく。
# .head()で表の上から５件のレコードを表示することが出来る。
#　すべてのデータを表示させず、headを使う。どんなデータかな？と見る際に便利。
df = pd.read_csv('/content/drive/My Drive/Colab Notebooks/Python_tutorial/tmdb_5000_movies.csv')
df.head(3)

      budget  ... vote_count
0  237000000  ...      11800
1  300000000  ...       4500
2  245000000  ...       4466

[3 rows x 20 columns]

In [ ]:
# データが何行あるか確認する
# この例では、4803行存在している。
len(df)

4803

In [ ]:
# カラムを省略せずにすべて表示する
# pd.set_option('display.max_columns', None)

# 行を省略せずにすべて表示する
# pd.set_option('display.max_rows', None)

# エクセルのファイルを開いたときのように、すべてのデータを表示することはめったに無い。
# Pythonでは、必要なデータだけを抽出することが多い。（RAMの無駄のため。）
# 上記のコードを実行するとずっと保持されてしまうので、上記のタブからランタイムを再起動する

## df.describe()

In [ ]:
#  .describe()で、統計量を確認する。一発で出してくれるので便利。（数値項目に限定される）
# Budgetの最小値が0だったらおかしい。
df.describe()
# df.describe()も新しいデータフレームであることがわかる。
# type(df.describe())

             budget             id  ...  vote_average    vote_count
count  4.803000e+03    4803.000000  ...   4803.000000   4803.000000
mean   2.904504e+07   57165.484281  ...      6.092172    690.217989
std    4.072239e+07   88694.614033  ...      1.194612   1234.585891
min    0.000000e+00       5.000000  ...      0.000000      0.000000
25%    7.900000e+05    9014.500000  ...      5.600000     54.000000
50%    1.500000e+07   14629.000000  ...      6.200000    235.000000
75%    4.000000e+07   58610.500000  ...      6.800000    737.000000
max    3.800000e+08  459488.000000  ...     10.000000  13752.000000

[8 rows x 7 columns]

In [ ]:
# このdfのカラムの一覧を見る事が出来る
df.columns

Index(['budget', 'genres', 'homepage', 'id', 'keywords', 'original_language',
       'original_title', 'overview', 'popularity', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'vote_average',
       'vote_count'],
      dtype='object')

In [5]:
# df['カラム名']で、特定のカラムのSeriesを取得出来る
# df['revenue']
df['popularity']

# typeで調べると、seriesであることがわかる
# type(df['popularity'])

0       150.437577
1       139.082615
2       107.376788
3       112.312950
4        43.926995
           ...
4798     14.269792
4799      0.642552
4800      1.444476
4801      0.857008
4802      1.929883
Name: popularity, Length: 4803, dtype: float64

In [3]:
# .カラム名でも表示できるが、基本的には非推奨。
# カラム名にスペースがある場合に打てなくなってしまう。
# また、.はすでに定義されている関数を呼び出すために利用するため。カラムを呼び出すのには使わない。
df.revenue

0       2787965087
1        961000000
2        880674609
3       1084939099
4        284139100
           ...
4798       2040920
4799             0
4800             0
4801             0
4802             0
Name: revenue, Length: 4803, dtype: int64

In [10]:
# カラムをリストで渡すと任意の列を返してくれる
df[['budget','genres','homepage']]

         budget  ...                                           homepage
0     237000000  ...                        http://www.avatarmovie.com/
1     300000000  ...       http://disney.go.com/disneypictures/pirates/
2     245000000  ...        http://www.sonypictures.com/movies/spectre/
3     250000000  ...                 http://www.thedarkknightrises.com/
4     260000000  ...               http://movies.disney.com/john-carter
...         ...  ...                                                ...
4798     220000  ...                                                NaN
4799       9000  ...                                                NaN
4800          0  ...  http://www.hallmarkchannel.com/signedsealeddel...
4801          0  ...                        http://shanghaicalling.com/
4802          0  ...                                                NaN

[4803 rows x 3 columns]

In [15]:
# .iloc[index]で、特定の行のSeriesを取得できる
# 以下の例では、Indexが１０のSeriesを返してくれる
# ｄｆ[10]という書き方はしないのに注意すること
df.iloc[10:13]

       budget  ... vote_count
10  270000000  ...       1400
11  200000000  ...       2965
12  200000000  ...       5246

[3 rows x 20 columns]

In [16]:
# スライシングを使うことも出来る。
df.iloc[10:13]

       budget  ... vote_count
10  270000000  ...       1400
11  200000000  ...       2965
12  200000000  ...       5246

[3 rows x 20 columns]

In [18]:
# カラムが数字でIndexが文字列の場合を考えてみる
# 基本的には無いパターン。カラムには文字列、Indexが数字を使うことが多い。
# この場合どのようにインデックスを指定できるのか？
ndarray = np.arange(25).reshape(5, 5)
index = ['a', 'b', 'c', 'd', 'e']
colums = [0, 1, 2, 3, 4]
df = pd.DataFrame(ndarray, index=index, columns=colums)
df

    0   1   2   3   4
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [19]:
# その時は、.locに文字列を指定して引っ張ってくる。
df.loc['b']

0    5
1    6
2    7
3    8
4    9
Name: b, dtype: int64

In [35]:
s = pd.Series([100, 100, 100, 100, 100], index=['a', 'b', 'c', 'd', 'e'])
df[0]

a     0
b     5
c    10
d    15
e    20
Name: 0, dtype: int64

In [36]:
s

a    100
b    100
c    100
d    100
e    100
dtype: int64

In [42]:
# DataFrameの１番目に、同じインデックスとカラムを持つsを代入した
# Seriesを使うことで、指定カラムの更新・追加をすることができる
# この操作については頻繁に使うので、覚えておくこと
df[0] = s

In [40]:
df

     0   1   2   3   4
a  100   1   2   3   4
b  100   6   7   8   9
c  100  11  12  13  14
d  100  16  17  18  19
e  100  21  22  23  24

In [45]:
# 無いカラムを指定するとどうなるのか
# 無いカラムに追加される
df[5] = s

In [44]:
df

     0   1   2   3   4    5
a  100   1   2   3   4  100
b  100   6   7   8   9  100
c  100  11  12  13  14  100
d  100  16  17  18  19  100
e  100  21  22  23  24  100

## .drop()

In [47]:
df = pd.read_csv('/content/drive/My Drive/Colab Notebooks/Python_tutorial/tmdb_5000_movies.csv')
df.head(5)

      budget  ... vote_count
0  237000000  ...      11800
1  300000000  ...       4500
2  245000000  ...       4466
3  250000000  ...       9106
4  260000000  ...       2124

[5 rows x 20 columns]

In [58]:
# カラムを落とすときはaxis=1を指定する。デフォルトは０
# 上下の表を比較すると、genres列が消滅していることがわかる
# 元のデータフレームは変更されない。
# 元のデータフレームを変更するためには、inplace=Trueを指定する(あまり使わない)
df.drop('id', axis=1, inplace=True)

KeyError: ignored